{
  "backend/main.mo": "Main actor implementing a token burn and claim system with functions to record burn events, manage Disintegrate token balances, and query burn history with various sorting and filtering options.",
  "backend/migration.mo": "Migration module defining the actor state structure (burnEvents and balances maps) with a run function that currently performs no-op migration.",
  "feature_evidence.json": "Feature evidence report documenting three implemented features: wallet interface for dual token display, React Query hook for ICP balance fetching, and token interaction restrictions.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of frontend files including components (WalletInterface, BurnInterface, BurnHistory, Layout), hooks (useQueries, useClaimTokens, useBurnTransaction), and styling configuration.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables defining a cyberpunk color palette using OKLCH color space for light and dark themes.",
  "frontend/index.html": "HTML entry point for the Disintegrate DeFi Protocol application with root div and module script reference.",
  "frontend/src/App.tsx": "Root application component wrapping the app with ThemeProvider, InternetIdentityProvider, and Layout, rendering WalletInterface, BurnInterface, BurnHistory, and Toaster components.",
  "frontend/src/components/BurnAnimation.tsx": "Animated visualization component displaying ICP burn icon with particle effects, glow rings, and pulsing animations when burn operations are active.",
  "frontend/src/components/BurnHistory.tsx": "Table component displaying burn transaction history with timestamps, ICP amounts, and Disintegrate tokens earned, including total summaries for both token types.",
  "frontend/src/components/BurnInterface.tsx": "Primary burn interface with ICP address display and copy functionality, amount input field, and burn button that triggers token claiming with authentication checks.",
  "frontend/src/components/Layout.tsx": "Main layout component with cyberpunk-themed header, footer, and animated background featuring gradient overlays, grid patterns, and a flame logo. Wraps all page content with consistent branding and styling.",
  "frontend/src/components/TokenBalanceDisplay.tsx": "Displays user's Disintegrate token balance with login prompt if unauthenticated. Shows formatted DIS balance earned from burning ICP (1:1 ratio) with loading states and informational messages.",
  "frontend/src/components/WalletInterface.tsx": "Wallet component displaying both ICP and Disintegrate token balances with login gate. Formats and shows balances in separate cards with loading states and cyberpunk styling.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages the backend actor instance based on Internet Identity authentication state. Automatically invalidates dependent queries when identity changes.",
  "frontend/src/hooks/useBurnTransaction.ts": "Empty file placeholder for burn transaction hook functionality.",
  "frontend/src/hooks/useClaimTokens.ts": "Hook for claiming Disintegrate tokens after burning ICP. Manages claim transaction state, calls backend actor, and invalidates relevant queries on success.",
  "frontend/src/hooks/useInternetIdentity.ts": "Comprehensive Internet Identity authentication provider and hook using AuthClient. Manages login flow, identity persistence, and authentication state with React context.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for fetching burn history, Disintegrate token balance, and ICP balance from the backend actor. All queries depend on authenticated actor availability.",
  "frontend/src/index.css": "Global styles with Tailwind CSS, custom cyberpunk color palette using OKLCH, glow effects, animations, and typography using Orbitron and Rajdhani fonts. Defines light and dark theme variables.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query client and Internet Identity provider, then renders the root App component into the DOM.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration file that defines custom color schemes using OKLCH color space (including cyber-themed colors), extended theme settings for containers, border radius, shadows, and font families. Includes plugins for typography, container queries, and animations.",
  "project_state.json": "Project state metadata for Disintegrate DeFi Protocol, tracking implemented features (wallet interface with ICP/Disintegrate token balances, React Query hooks) and pending feature requests (wallet integration and ICP balance backend query). Indicates this is a DeFi protocol for burning ICP tokens with burn history and token claiming capabilities."
}